//
//  CountriesArrays.swift
//  GuessFlag2
//
//  Created by Nikita Stepanov on 17.09.2022.
//

import Foundation
import UIKit

struct CountriesArray {
    // you can add your own ones
    var current = ["США", "ОАЭ", "Бразилия", "Канада", "Германия", "Греция", "Швеция", "Аргентина", "Бельгия", "Белоруссия", "Швейцария", "Китай",  "Финляндия",  "Испания", "Хорватия"].shuffled()
    
    let countries0 =  ["США", "ОАЭ", "Бразилия", "Канада", "Германия", "Греция", "Швеция", "Аргентина", "Бельгия", "Белоруссия", "Швейцария", "Китай",  "Финляндия",  "Испания", "Хорватия", "Израиль"].shuffled()
    
    let countries1 = [ "Бангладеш", "Бельгия", "Афганистан", "Албания", "Австрия", "Азербайджан", "Конго", "ЦАР" , "Андорра", "Болгария",  "Ботсвана", "Багамские о-ва", "Бенин", "Бутан", "Кипр", "Хорватия", "Словакия", "Словения"].shuffled()
    
    let countries2 = ["Аруба","Босния и Герцеговина","Барбадос","Буркина Фасо","Бурунди","Белиз","Кабо-Верде","Конго-Киншаса","Коста-Рика","Гваделупа","Гвинея","Непал","Нигер","Замбия","Зимбабве"].shuffled()
    
    let countries3 = ["Аруба","Босния и Герцеговина","Барбадос","Буркина Фасо","Бурунди","Белиз","Кабо-Верде","Конго-Киншаса","Коста-Рика","Гваделупа","Гвинея","Непал","Нигер","Замбия","Зимбабве","Бангладеш", "Бельгия", "Афганистан", "Албания", "Австрия", "Азербайджан", "Конго", "ЦАР" , "Андорра", "Болгария",  "Ботсвана", "Багамские о-ва", "Бенин", "Бутан", "Кипр", "Хорватия", "Словакия", "Словения", "США", "ОАЭ", "Бразилия", "Канада", "Германия", "Греция", "Швеция", "Аргентина", "Белоруссия", "Швейцария", "Китай",  "Финляндия",  "Испания", "Российская империя"].shuffled()
}

